# -*- coding: utf-8 -*-

import pandas as pd
exam_data = {'이름' : ['유비', '관우', '장비'],
             '국어' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '수학' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data)

df.set_index('이름', inplace=True)
print(df)
print("============================================")

df.iloc[0][3] = 80
print(df)
print("============================================")

#방법2 : 문자형 인덱스 사용
df.loc['유비']['체육'] = 90
print(df)

print("============================================")
#방법3 : 콤마를 사용
df.loc['유비', '체육'] = 100
print(df)


df['음악'] = 0
print(df)
df.loc['관우',['체육', '음악']] = 50
print(df)




print("============================================")
#다수의 원소를 수정하기 : 관우의 영어 및 체육점수를 변경한다.
df.loc['관우',['체육', '음악']] = 50
print(df)

#교재에는 '관우',['음악', '체육'] = 100, 50인데 순서를 바꿔서 체육, 음악으로 작성 50.0만 실수 발생
print("============================================")
#방법2
df.loc['관우', ['체육', '음악']] = 100, 50
print(df)


print(type(df.loc['관우', '음악']))
print(type(df.loc['관우', '체육']))


